# LoadClassification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Reference..::..LoadClassification Property
SpecTypeId..::..Reference Class See Also
---
Load Classification, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadClassification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadClassification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadClassification {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId..::..Reference Class
Autodesk.Revit.DB Namespace